app/views/shared/_abouts.html.erb

SELECT 1 AS one FROM "abouts" LIMIT $1  [["LIMIT", 1]]
---
<!-- Start About Area -->
<% if About.exists? %>