app/views/shared/_banners.html.erb

SELECT 1 AS one FROM "banners" LIMIT $1  [["LIMIT", 1]]
---

<% if Banner.exists? %>