app/views/shared/_faqs.html.erb


    <% if Faq.exists? %>
---
SELECT 1 AS one FROM "faqs" LIMIT $1  [["LIMIT", 1]]