app/views/shared/_features.html.erb


<% if Feature.exists? %>
---
SELECT 1 AS one FROM "features" LIMIT $1  [["LIMIT", 1]]