app/views/shared/_footer.html.erb

SELECT "welcomes".* FROM "welcomes" LIMIT $1  [["LIMIT", 1]]
SELECT 1 AS one FROM "welcomes" LIMIT $1  [["LIMIT", 1]]
---

  <% if Welcome.exists? %>