app/views/shared/_reviews.html.erb


  <% if Review.exists? %>
---
SELECT 1 AS one FROM "reviews" LIMIT $1  [["LIMIT", 1]]