app/views/shared/_services.html.erb

SELECT 1 AS one FROM "services" LIMIT $1  [["LIMIT", 1]]
---

<% if Service.exists? %>