app/controllers/accounts_controller.rb

  def index
    @welcomes = Welcome.all.order('created_at DESC')
    @headers = Header.all
    @users = User.where(user_id: current_user)
    @accounts = Account.where(user_id: current_user).order('created_at DESC')
    # @reservations = Reservation.where(user_id: current_user).order('created_at DESC')
    @vehicles = Vehicle.where(user_id: current_user).order('created_at DESC')
---
SELECT "headers".* FROM "headers" LIMIT $1  [["LIMIT", 1]]
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]

  def create
    @account = current_user.accounts.build(account_params)
    @account.user_id = current_user.id
    if @account.save
      user = User.find_by_id(@account.user_id)
---
INSERT INTO "accounts" ("account_number", "status", "slug", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["account_number", "3069401419"], ["status", true], ["slug", "3069401419"], ["user_id", 1], ["created_at", "2023-06-19 22:48:26.085601"], ["updated_at", "2023-06-19 22:48:26.085601"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]