app/controllers/reporepairs_controller.rb

    def index
      @welcomes = Welcome.all.order('created_at DESC')
      @headers = Header.all
      @users = User.where(user_id: current_user)
      @reporepairs = Reporepair.where(user_id: current_user).order('created_at DESC')
---
SELECT "headers".* FROM "headers" LIMIT $1  [["LIMIT", 1]]
SELECT "reporepairs".* FROM "reporepairs" WHERE "reporepairs"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]