app/controllers/reporescues_controller.rb

    def index
      @welcomes = Welcome.all.order('created_at DESC')
      @headers = Header.all
      @users = User.where(user_id: current_user)
      @reporescues = Reporescue.where(user_id: current_user).order('created_at DESC')
---
SELECT "headers".* FROM "headers" LIMIT $1  [["LIMIT", 1]]
SELECT "reporescues".* FROM "reporescues" WHERE "reporescues"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]