app/controllers/vehicles_controller.rb

  def index
    @welcomes = Welcome.all.order('created_at DESC')
    @headers = Header.all
    @users = User.where(user_id: current_user)
    @vehicles = Vehicle.where(user_id: current_user).order('created_at DESC')
---
SELECT "headers".* FROM "headers" LIMIT $1  [["LIMIT", 1]]
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]

    def show
      @welcomes = Welcome.all.order('created_at DESC')
      @headers = Header.all
---
SELECT "headers".* FROM "headers" LIMIT $1  [["LIMIT", 1]]

  def create
    @vehicle = current_user.vehicles.build(vehicle_params)
    @vehicle.user_id = current_user.id
    if @vehicle.save
      user = User.find_by_id(@vehicle.user_id)
---
INSERT INTO "vehicles" ("l_first_name", "l_last_name", "l_address", "l_email", "v_name", "v_type", "v_plate_number", "v_info", "slug", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]