app/controllers/welcomes_controller.rb

SELECT "welcomes".* FROM "welcomes" LIMIT $1  [["LIMIT", 1]]
SELECT "abouts".* FROM "abouts" ORDER BY created_at DESC
SELECT "services".* FROM "services" ORDER BY created_at DESC
---
  def index
    @welcomes = Welcome.all
    @abouts = About.all.order('created_at DESC')
    @headers = Header.all.order('created_at DESC')
@luxListingitems = LuxListingitem.all.order('created_at ASC')
    @services = Service.all.order('created_at ASC')