app/views/accounts/_topbox.html.erb

SELECT COUNT(*) FROM "vehicles" WHERE "vehicles"."user_id" = $1  [["user_id", 1]]
---
                                                      <h3 class="my-1 font-20 fw-bold">
                                                        <%= Vehicle.where(user_id: current_user.id).count %>

SELECT COUNT(*) FROM "reporescues" WHERE "reporescues"."user_id" = $1  [["user_id", 1]]
---
                                                      <h3 class="my-1 font-20 fw-bold">
                                                        <%= Reporescue.where(user_id: current_user.id).count %>